---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagNotInRoomToRoom
source: html/b8b91f15-a046-7354-8abe-17c930153e50.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagNotInRoomToRoom Property

[Room] Tag is outside of its [Room]. Enable Leader or move [Room] Tag within its [Room].

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomTagNotInRoomToRoom { get; }
```